{"id": 1, "title": "Computer Science", "content": "Computer science is the study of computation, information, and automation. It encompasses the theory, design, development, and application of computer software and hardware systems.", "category": "Computer Science"}
{"id": 2, "title": "Artificial Intelligence", "content": "Artificial intelligence is intelligence demonstrated by machines, as opposed to natural intelligence displayed by animals including humans. AI research has been defined as the field of study of intelligent agents.", "category": "AI"}
{"id": 3, "title": "Machine Learning", "content": "Machine learning is a branch of artificial intelligence and computer science which focuses on the use of data and algorithms to imitate the way that humans learn, gradually improving accuracy.", "category": "AI"}
{"id": 4, "title": "Data Structures", "content": "Data structures are specialized formats for organizing, processing, retrieving and storing data. Different kinds of data structures are suited to different applications.", "category": "Computer Science"}
{"id": 5, "title": "Algorithms", "content": "An algorithm is a finite sequence of rigorous instructions, typically used to solve a class of specific problems or to perform a computation.", "category": "Computer Science"}
{"id": 6, "title": "Software Engineering", "content": "Software engineering is the systematic application of engineering approaches to the development of software. It is a computing discipline.", "category": "Software Development"}
{"id": 7, "title": "Database Management", "content": "Database management systems are software systems used to store, retrieve, and run queries on data. A DBMS serves as an interface between an end user and a database.", "category": "Databases"}
{"id": 8, "title": "Operating Systems", "content": "Operating systems manage computer hardware and software resources and provide common services for computer programs. Common examples include Linux, Windows, and macOS.", "category": "Systems"}
{"id": 9, "title": "Networking", "content": "Networking involves the practice of connecting computers and other devices together to share resources. The Internet is the largest computer network in the world.", "category": "Networks"}
{"id": 10, "title": "Cybersecurity", "content": "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks. These attacks usually aim to access, change, or destroy sensitive information.", "category": "Security"}
{"id": 11, "title": "Cloud Computing", "content": "Cloud computing delivers computing services including servers, storage, databases, networking, software, and analytics over the Internet. It offers faster innovation and flexible resources.", "category": "Cloud"}
{"id": 12, "title": "Deep Learning", "content": "Deep learning is part of a broader family of machine learning methods based on artificial neural networks with representation learning. It has been applied to fields including computer vision and natural language processing.", "category": "AI"}
{"id": 13, "title": "Natural Language Processing", "content": "Natural language processing is a subfield of linguistics and artificial intelligence concerned with the interactions between computers and human language. It involves programming computers to process and analyze large amounts of natural language data.", "category": "AI"}
{"id": 14, "title": "Computer Vision", "content": "Computer vision is an interdisciplinary field that deals with how computers can gain high-level understanding from digital images or videos. It seeks to automate tasks that the human visual system can do.", "category": "AI"}
{"id": 15, "title": "Quantum Computing", "content": "Quantum computing uses quantum-mechanical phenomena such as superposition and entanglement to perform computation. Quantum computers are believed to solve certain problems faster than classical computers.", "category": "Emerging Tech"}
{"id": 16, "title": "Blockchain", "content": "Blockchain is a distributed ledger technology that maintains a continuously growing list of records called blocks. Each block contains a cryptographic hash of the previous block, timestamp, and transaction data.", "category": "Emerging Tech"}
{"id": 17, "title": "DevOps", "content": "DevOps is a set of practices that combines software development and IT operations. It aims to shorten the systems development life cycle and provide continuous delivery with high software quality.", "category": "Software Development"}
{"id": 18, "title": "Version Control", "content": "Version control systems track and manage changes to software code over time. Git is the most popular distributed version control system used by developers worldwide.", "category": "Software Development"}
{"id": 19, "title": "Agile Development", "content": "Agile software development describes an approach to software development under which requirements and solutions evolve through collaborative effort. It advocates adaptive planning and evolutionary development.", "category": "Software Development"}
{"id": 20, "title": "Web Development", "content": "Web development encompasses the work involved in developing websites for the Internet or an intranet. It ranges from developing simple static pages to complex web applications and social network services.", "category": "Software Development"}
{"id": 21, "title": "Mobile Development", "content": "Mobile application development is the process of creating software applications that run on mobile devices. It requires consideration of screen sizes, hardware specifications, and mobile operating systems.", "category": "Software Development"}
{"id": 22, "title": "APIs", "content": "Application programming interfaces define interactions between multiple software intermediaries. They specify the kinds of calls or requests that can be made, how to make them, and the data formats to use.", "category": "Software Development"}
{"id": 23, "title": "Microservices", "content": "Microservices architecture structures an application as a collection of loosely coupled services. Each service is fine-grained and the protocols are lightweight, making the system more flexible.", "category": "Software Development"}
{"id": 24, "title": "Containerization", "content": "Containerization involves encapsulating an application in a container with its own operating environment. Docker is the most popular containerization platform used in modern software development.", "category": "DevOps"}
{"id": 25, "title": "Big Data", "content": "Big data refers to data sets that are too large or complex to be dealt with by traditional data-processing application software. It is characterized by volume, velocity, variety, and veracity.", "category": "Data Science"}
{"id": 26, "title": "Data Mining", "content": "Data mining is the process of discovering patterns in large data sets involving methods at the intersection of machine learning, statistics, and database systems. It aims to extract information from data and transform it into an understandable structure.", "category": "Data Science"}
{"id": 27, "title": "Internet of Things", "content": "Internet of Things describes physical objects embedded with sensors and software that connect and exchange data with other devices over the Internet. IoT enables objects to be sensed and controlled remotely.", "category": "Emerging Tech"}
{"id": 28, "title": "Virtual Reality", "content": "Virtual reality is a simulated experience that can be similar to or completely different from the real world. VR technology immerses users in a computer-generated environment through headsets and motion tracking.", "category": "Emerging Tech"}
{"id": 29, "title": "Augmented Reality", "content": "Augmented reality is an interactive experience that combines the real world and computer-generated content. AR overlays digital information onto the physical environment through devices like smartphones and AR glasses.", "category": "Emerging Tech"}
{"id": 30, "title": "Cryptography", "content": "Cryptography is the practice and study of techniques for secure communication in the presence of adversarial behavior. Modern cryptography is heavily based on mathematical theory and computer science practice.", "category": "Security"}
{"id": 31, "title": "Distributed Systems", "content": "Distributed systems consist of multiple autonomous computers that communicate through a computer network. They appear to users as a single coherent system and coordinate their actions by passing messages.", "category": "Systems"}
{"id": 32, "title": "Parallel Computing", "content": "Parallel computing is a type of computation in which many calculations or processes are carried out simultaneously. Large problems can be divided into smaller ones, which are then solved concurrently.", "category": "Computer Science"}
{"id": 33, "title": "Compiler Design", "content": "Compiler design involves the creation of programs that translate source code written in one programming language into another language. Compilers enable programmers to write code in high-level languages.", "category": "Computer Science"}
{"id": 34, "title": "Computer Graphics", "content": "Computer graphics involves the creation, manipulation, and representation of visual content using computers. It includes techniques for rendering images, animations, and visual effects.", "category": "Computer Science"}
{"id": 35, "title": "Human-Computer Interaction", "content": "Human-computer interaction studies the design and use of computer technology focused on the interfaces between people and computers. HCI research observes how humans interact with computers and designs technologies that let humans interact with computers in novel ways.", "category": "Computer Science"}
{"id": 36, "title": "Software Testing", "content": "Software testing is an investigation conducted to provide stakeholders with information about the quality of the software product under test. Testing processes include validation and verification.", "category": "Software Development"}
{"id": 37, "title": "Continuous Integration", "content": "Continuous integration is the practice of merging all developers' working copies to a shared mainline several times a day. It helps detect integration bugs early and reduce integration problems.", "category": "DevOps"}
{"id": 38, "title": "Regular Expressions", "content": "Regular expressions are sequences of characters that define search patterns, mainly used for pattern matching with strings. They are widely used in text processing and validation tasks.", "category": "Programming"}
{"id": 39, "title": "Object-Oriented Programming", "content": "Object-oriented programming is a programming paradigm based on the concept of objects containing data and code. The four main principles are encapsulation, abstraction, inheritance, and polymorphism.", "category": "Programming"}
{"id": 40, "title": "Functional Programming", "content": "Functional programming is a programming paradigm where programs are constructed by applying and composing functions. It emphasizes immutability and avoids changing-state and mutable data.", "category": "Programming"}
{"id": 41, "title": "Recursion", "content": "Recursion is a method of solving computational problems where the solution depends on solutions to smaller instances of the same problem. Recursive algorithms call themselves with modified parameters.", "category": "Programming"}
{"id": 42, "title": "Binary Search Trees", "content": "Binary search trees are data structures that maintain sorted data and allow fast lookup, addition, and removal of items. Each node has at most two children, referred to as the left child and right child.", "category": "Data Structures"}
{"id": 43, "title": "Hash Tables", "content": "Hash tables are data structures that implement an associative array, a structure that maps keys to values. They use a hash function to compute an index into an array of buckets from which the desired value can be found.", "category": "Data Structures"}
{"id": 44, "title": "Graph Theory", "content": "Graph theory studies graphs as mathematical structures used to model pairwise relations between objects. Graphs are widely used in computer science to represent networks, data organization, and computational relationships.", "category": "Computer Science"}
{"id": 45, "title": "Dynamic Programming", "content": "Dynamic programming is a method for solving complex problems by breaking them down into simpler subproblems. It stores the results of subproblems to avoid redundant computations.", "category": "Algorithms"}
{"id": 46, "title": "Greedy Algorithms", "content": "Greedy algorithms make locally optimal choices at each stage with the hope of finding a global optimum. They are used in optimization problems where making the best choice at each step leads to an overall optimal solution.", "category": "Algorithms"}
{"id": 47, "title": "Computational Complexity", "content": "Computational complexity theory focuses on classifying computational problems according to their resource usage. It studies the time and space required by algorithms to solve problems of various sizes.", "category": "Computer Science"}
{"id": 48, "title": "Information Retrieval", "content": "Information retrieval is the process of obtaining relevant information from large repositories based on user queries. Search engines are the most visible information retrieval applications.", "category": "Computer Science"}
{"id": 49, "title": "Semantic Web", "content": "Semantic web extends the World Wide Web through standards that promote common data formats and exchange protocols. It enables data to be shared and reused across application, enterprise, and community boundaries.", "category": "Web"}
{"id": 50, "title": "Edge Computing", "content": "Edge computing brings computation and data storage closer to the sources of data to improve response times and save bandwidth. It is particularly important for Internet of Things applications and real-time data processing.", "category": "Cloud"}
